In [1]:
import my_utils as mu

ModuleNotFoundError: No module named 'my_utils'

In [2]:
import requests

In [11]:
api_key = '5478465a5763686a313037546a74786f'
url = f'http://openapi.seoul.go.kr:8088/{api_key}/json/tbLnOpendataRentV/1/1000/'

In [4]:
df = mu.df_creater(url)

NameError: name 'mu' is not defined

In [5]:
sel_c = ['SGG_NM', 'BJDONG_NM', 'LAND_GBN_NM', 'FLR_NO', 'CNTRCT_DE', 'RENT_GBN', 'RENT_AREA', 'RENT_GTN', 'RENT_FEE'. 'BLDG_NM', 'BUILD_YEAR']

SyntaxError: invalid syntax (1964505790.py, line 1)

In [6]:
my_df = df[sel_c].copy()

NameError: name 'df' is not defined

In [7]:
my_df.columns = ['자치구명', '법정동명', '지번구분명', '층수', '계약일', '전월세', '면적', '보증금', '임대료', '건물명','건축년도']

NameError: name 'my_df' is not defined

In [8]:
my_df = my_df.astype({'층수' : 'float', '계약일' : 'int', '면적' : 'float', '보증금' : 'int', '임대료' : 'int'})

NameError: name 'my_df' is not defined

In [10]:
query = """
    CREATE TABLE housePrice(자치구명 varchar(50), 법정동명 varchar(50), 지번구분명 varchar(50). 층수 float(20), 계약일 number(20), 전월세 varchar(20), 면적 float(20), 보증금 number(20), 임대료 number(20), 건물명 varchar(100). 건축년도 varchar(20))
"""

In [9]:
mu.db_open()
mu.orcle_execute(query2)

NameError: name 'mu' is not defined

In [12]:
query2 = """
    CREATE TABLE housePrice(자치구명 varchar(50), 법정동명 varchar(50), 지번구분명 varchar(50). 층수 float, 계약일 int, 전월세 varchar(20), 면적 float, 보증금 int, 임대료 int, 건물명 varchar(100). 건축년도 varchar(20))
"""

In [13]:
conn = mu.connect_mysql('icia')
mu.mysql_execute(query2, conn)

NameError: name 'mu' is not defined

In [16]:
query4 = (
    f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
    f'values({repr(my_df.자치구명.iloc[0])}, {repr(my_df.법정동명.iloc[0])}')
    f'{repr(my_df.지번구분명.iloc[0])}, {my_df.층수.iloc[0]}'
    f'{my_df.계약일.iloc[0]}, {repr(my_df.전월세.iloc[0])}'
    f'{my_df.면적.iloc[0]}, {my_df.보증금.iloc[0]}'
    f'{my_df.임대료.iloc[0]}, {repr(my_df.건물명.iloc[0])}, {repr(my_df.건축년도.iloc[0])}'

IndentationError: unexpected indent (2291910793.py, line 4)

In [17]:
mu.db_open()
mu.oracle_execute(query4)
mu.db_close()

NameError: name 'mu' is not defined

In [18]:
query5 = 'select * from houserPrice'

In [19]:
mu.mysql_execute(query5, conn)

NameError: name 'mu' is not defined

In [20]:
my_df

NameError: name 'my_df' is not defined

In [21]:
query4

'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'

In [22]:
conn = mu.connect_mysql('icia')
mu.mysql_exectue(query4, conn)
conn.commit()
conn.close()

NameError: name 'mu' is not defined

In [ ]:
conn = mu.connect_mysql('icia')
query5 = 'select * from housePrice'
mu.mysql_execute(query5, conn)

In [23]:
# insert 문을 함수로 만들 예정.

In [24]:
#mySql
conn = mu.connect_mysql('icia')
for i in tqdm(range(len(my_df))) :
    query4 = (
    f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
    f'values({repr(my_df.자치구명.iloc[0])}, {repr(my_df.법정동명.iloc[0])}')
    f'{repr(my_df.지번구분명.iloc[0])}, {my_df.층수.iloc[0]}'
    f'{my_df.계약일.iloc[0]}, {repr(my_df.전월세.iloc[0])}'
    f'{my_df.면적.iloc[0]}, {my_df.보증금.iloc[0]}'
    f'{my_df.임대료.iloc[0]}, {repr(my_df.건물명.iloc[0])}, {repr(my_df.건축년도.iloc[0])}'
    mu.mysql_exectue(query4, conn)
conn.commit()
conn.close()

NameError: name 'mu' is not defined

In [ ]:
# Oracle
mu.db_open()
for i in tqdm(range(len(my_df))) :
    query4 = (
    f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
    f'values({repr(my_df.자치구명.iloc[0])}, {repr(my_df.법정동명.iloc[0])}')
    f'{repr(my_df.지번구분명.iloc[0])}, {my_df.층수.iloc[0]}'
    f'{my_df.계약일.iloc[0]}, {repr(my_df.전월세.iloc[0])}'
    f'{my_df.면적.iloc[0]}, {my_df.보증금.iloc[0]}'
    f'{my_df.임대료.iloc[0]}, {repr(my_df.건물명.iloc[0])}, {repr(my_df.건축년도.iloc[0])}'
    mu.orcle_execute(query4, conn)
mu.oracle_close()

In [25]:
from tqdm import tqdm

In [ ]:
conn = mu.connect_mysql('icia')
df =pd.DataFrmae(mu.mysql_execute_dict(query5, conn))

In [ ]:
def df_insert_mysql(df) :
    query4 = (
    f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
    f'values({repr(my_df.자치구명.iloc[i])}, {repr(my_df.법정동명.iloc[i])}')
    f'{repr(my_df.지번구분명.iloc[i])}, {my_df.층수.iloc[i]}'
    f'{my_df.계약일.iloc[i]}, {repr(my_df.전월세.iloc[i])}'
    f'{my_df.면적.iloc[i]}, {my_df.보증금.iloc[i]}'
    f'{my_df.임대료.iloc[i]}, {repr(my_df.건물명.iloc[i])}, {repr(my_df.건축년도.iloc[i])}
    )
    mu.mysql_execute(query4, conn)
    return

In [ ]:
def df_insert_oracle(df) :
    query4 = (
    f'insert into housePrice(자치구명, 법정동명, 지번구분명, 층수, 계약일, 전월세, 면적, 보증금, 임대료, 건물명, 건축년도)'
    f'values({repr(my_df.자치구명.iloc[i])}, {repr(my_df.법정동명.iloc[i])}')
    f'{repr(my_df.지번구분명.iloc[i])}, {my_df.층수.iloc[i]}'
    f'{my_df.계약일.iloc[i]}, {repr(my_df.전월세.iloc[i])}'
    f'{my_df.면적.iloc[i]}, {my_df.보증금.iloc[i]}'
    f'{my_df.임대료.iloc[i]}, {repr(my_df.건물명.iloc[i])}, {repr(my_df.건축년도.iloc[i])}
    )
    mu.orcle_execute(query4, conn)
    return

## 서울시 공공 데이터 포탈 - 서울시 코로나 19 확진자 발생 동향
## api를 통해서 함수 만들었던 것으로 데이터 불러오기
## 컬러명 - 서울시 기준일, 서울시 확진자, 서울시 치료중, 서울시 퇴원, 서울시 사망, 전국 확진, 전국 사망
## 'S_DT', 'S_HJ', 'S_CARE', 'S_RECOVER', 'S_DEATE', 'T_HJ', 'DEATH'
## DB에 테이블 생성, INSERT(CORONA19 COUNTSTATUS)

In [1]:
import pandas as pd

In [2]:
import requests

In [62]:
import cx_Oracle as co

In [63]:
import pymysql as pms

In [5]:
# url로 데이터 가져와서 DataFrame 만들기

In [6]:
api_key = '5478465a5763686a313037546a74786f'
url = f'http://openapi.seoul.go.kr:8088/{api_key}/json/TbCorona19CountStatus/1/300/'

In [7]:
res = requests.get(url).json()

In [8]:
key = list(res.keys())[0]

In [9]:
df = pd.DataFrame(res[key]['row'])

In [10]:
df

,S_DT,S_HJ,SN_HJ,S_CARE,S_RECOVER,SN_RECOVER,S_DEATH,SY_TOTAL,SY_KJ,SY_KH,...,TY_TOTAL,TY_KJ,TY_KH,JGK_OVERSEAS_GS,JGK_OVERSEAS_GH,JGK_CONT_GS,JGK_CONT_GH,CHECKING,DAY_DEATH,ALL_DAY_DEATH
0,2023.03.10.00,5944743,2170,0,,,6359,,,,...,,,,,,,,0,1,12
1,2023.03.09.00,5942573,2131,0,,,6358,,,,...,,,,,,,,0,0,20
2,2023.03.08.00,5940442,2447,0,,,6358,,,,...,,,,,,,,0,0,12
3,2023.03.07.00,5937995,2748,0,,,6358,,,,...,,,,,,,,0,3,15
4,2023.03.06.00,5935247,734,0,,,6355,,,,...,,,,,,,,0,2,9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,2022.05.19.00,3582481,4557,0,,,4777,,,,...,,,,,,,,0,7,40
296,2022.05.18.00,3577930,5043,0,,,4770,,,,...,,,,,,,,0,5,31
297,2022.05.17.00,3572888,5889,0,,,4765,,,,...,,,,,,,,0,3,27
298,2022.05.16.00,3567016,1684,0,,,4762,,,,...,,,,,,,,0,5,35
299,2022.05.15.00,3565332,4025,0,,,4757,,,,...,,,,,,,,0,12,48

In [11]:
sel_c = ['S_DT', 'S_HJ', 'S_CARE', 'S_RECOVER', 'S_DEATH', 'T_HJ', 'DEATH']

In [37]:
my_df = df[sel_c].copy()

In [85]:
my_df.columns = ['서울시기준일', '서울시확진자', '서울시치료중', '서울시퇴원', '서울시사망', '전국확진', '전국사망']

In [86]:
my_df

            서울시기준일   서울시확진자  서울시치료중 서울시퇴원  서울시사망        전국확진     전국사망
0    2023.03.10.00  5944743       0         6359  30615522.0  34093.0
1    2023.03.09.00  5942573       0         6358  30605187.0  34081.0
2    2023.03.08.00  5940442       0         6358  30594297.0  34061.0
3    2023.03.07.00  5937995       0         6358  30581499.0  34049.0
4    2023.03.06.00  5935247       0         6355  30569215.0  34034.0
..             ...      ...     ...   ...    ...         ...      ...
295  2022.05.19.00  3582481       0         4777  17889849.0  23842.0
296  2022.05.18.00  3577930       0         4770  17861744.0  23802.0
297  2022.05.17.00  3572888       0         4765  17830429.0  23771.0
298  2022.05.16.00  3567016       0         4762  17795357.0  23744.0
299  2022.05.15.00  3565332       0         4757  17782061.0  23709.0

[300 rows x 7 columns]

In [52]:
# NoneType을 0으로 만들기 <= 집에서 해보기

In [42]:
my_df

           서울시 기준일  서울시 확진자 서울시 치료중 서울시 퇴원 서울시 사망     전국 확진  전국 사망
0    2023.03.10.00  5944743       0          6359  30615522  34093
1    2023.03.09.00  5942573       0          6358  30605187  34081
2    2023.03.08.00  5940442       0          6358  30594297  34061
3    2023.03.07.00  5937995       0          6358  30581499  34049
4    2023.03.06.00  5935247       0          6355  30569215  34034
..             ...      ...     ...    ...    ...       ...    ...
295  2022.05.19.00  3582481       0          4777  17889849  23842
296  2022.05.18.00  3577930       0          4770  17861744  23802
297  2022.05.17.00  3572888       0          4765  17830429  23771
298  2022.05.16.00  3567016       0          4762  17795357  23744
299  2022.05.15.00  3565332       0          4757  17782061  23709

[300 rows x 7 columns]

In [58]:
my_df.dtypes

서울시 기준일     object
서울시 확진자      int32
서울시 치료중      int32
서울시 퇴원      object
서울시 사망       int32
전국 확진      float64
전국 사망      float64
dtype: object

In [57]:
my_df = my_df.astype({'전국 사망' : 'float'})

In [59]:
my_df = my_df.fillna(0)

In [60]:
my_df

           서울시 기준일  서울시 확진자  서울시 치료중 서울시 퇴원  서울시 사망       전국 확진    전국 사망
0    2023.03.10.00  5944743        0           6359  30615522.0  34093.0
1    2023.03.09.00  5942573        0           6358  30605187.0  34081.0
2    2023.03.08.00  5940442        0           6358  30594297.0  34061.0
3    2023.03.07.00  5937995        0           6358  30581499.0  34049.0
4    2023.03.06.00  5935247        0           6355  30569215.0  34034.0
..             ...      ...      ...    ...     ...         ...      ...
295  2022.05.19.00  3582481        0           4777  17889849.0  23842.0
296  2022.05.18.00  3577930        0           4770  17861744.0  23802.0
297  2022.05.17.00  3572888        0           4765  17830429.0  23771.0
298  2022.05.16.00  3567016        0           4762  17795357.0  23744.0
299  2022.05.15.00  3565332        0           4757  17782061.0  23709.0

[300 rows x 7 columns]

In [65]:
dsn = co.makedsn('localhost', 1521, 'xe')
db = co.connect(user = 'icia', password = '1111', dsn = dsn)
cursor = db.cursor()

In [73]:
# 오라클 테이블 생성 쿼리
create_table_query = create_table_query = 'CREATE TABLE CORONA19_COUNTSTATUS(서울시기준일 VARCHAR(50),서울시확진자 NUMBER(20), 서울시치료중 NUMBER(20), 서울시퇴원 VARCHAR(20), 서울시사망 NUMBER(20), 전국확진 NUMBER(20), 전국사망 NUMBER(20))'

In [74]:
cursor.execute(create_table_query)

In [101]:
for i in range(len(my_df)):
    insert_table_query = (
        f'INSERT INTO CORONA19_COUNTSTATUS(서울시기준일, 서울시확진자, 서울시치료중, 서울시퇴원, 서울시사망, 전국확진, 전국사망)'
        f' VALUES({repr(my_df.서울시기준일.iloc[i])}, {my_df.서울시확진자.iloc[i]}, {my_df.서울시치료중.iloc[i]}, NULL'
        f', {my_df.서울시사망.iloc[i]}, {my_df.전국확진.iloc[i]}, {my_df.전국사망.iloc[i]})'
    )
    
    cursor.execute(insert_table_query);
db.commit()

In [97]:
insert_table_query = (
        f'INSERT INTO CORONA19_COUNTSTATUS(서울시기준일, 서울시확진자, 서울시치료중, 서울시퇴원, 서울시사망, 전국확진, 전국사망)'
        f' VALUES({repr(my_df.서울시기준일.iloc[0])}, {my_df.서울시확진자.iloc[0]}, {my_df.서울시치료중.iloc[0]}, NULL'
        f', {my_df.서울시사망.iloc[0]}, {my_df.전국확진.iloc[0]}, {my_df.전국사망.iloc[0]})'
    )

In [98]:
insert_table_query

"INSERT INTO CORONA19_COUNTSTATUS(서울시기준일, 서울시확진자, 서울시치료중, 서울시퇴원, 서울시사망, 전국확진, 전국사망) VALUES('2023.03.10.00', 5944743, 0, NULL, 6359, 30615522.0, 34093.0)"